# 3. Filtering, GroupBy, Aggregations

Q1. Using a DataFrame of sales data: ['Region', 'Product', 'Sales']
    Filter all rows where Sales > 1000.
    Group the data by Region and calculate the total sales.

In [2]:
import pandas as pd

In [3]:
sales = {
    'Region': ['North', 'South', 'East', 'West', 'North', 'South'],
    'Product': ['A', 'B', 'A', 'C', 'B', 'C'],
    'Sales': [1000, 1500, 800, 1200, 900, 1800]
}

df = pd.DataFrame(sales)
df

  Region Product  Sales
0  North       A   1000
1  South       B   1500
2   East       A    800
3   West       C   1200
4  North       B    900
5  South       C   1800

In [4]:
df[df["Sales"]>1000]

  Region Product  Sales
1  South       B   1500
3   West       C   1200
5  South       C   1800

In [5]:
df.groupby("Region")["Sales"].sum()

Region
East      800
North    1900
South    3300
West     1200
Name: Sales, dtype: int64

Q2. Create a DataFrame containing students' marks across subjects.
    Use groupby() to find the average marks per subject.
    Filter students who scored above 80 in all subjects.

In [6]:
students = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David','Alice', 'Bob', 'Charlie', 'David'],
    'Subject': ['Math', 'Math', 'Math', 'Math', 'Computer Science', 'Computer Science', 'Computer Science', 'Computer Science'],
    'Score': [90, 85, 78, 92, 82, 93, 79, 89]
}

In [7]:
stud_df = pd.DataFrame(students)
stud_df

      Name           Subject  Score
0    Alice              Math     90
1      Bob              Math     85
2  Charlie              Math     78
3    David              Math     92
4    Alice  Computer Science     82
5      Bob  Computer Science     93
6  Charlie  Computer Science     79
7    David  Computer Science     89

In [8]:
stud_df.groupby('Subject')['Score'].mean()

Subject
Computer Science    85.75
Math                86.25
Name: Score, dtype: float64

In [9]:
stud_df[stud_df['Score'] > 80]

    Name           Subject  Score
0  Alice              Math     90
1    Bob              Math     85
3  David              Math     92
4  Alice  Computer Science     82
5    Bob  Computer Science     93
7  David  Computer Science     89

In [11]:
stud_df['Score'].max()

np.int64(93)